<?php 

$massiv [9] = "Рабкор.Ру"; 
$massiv [10] = "Свободная Пресса"; 
$massiv [11] = "Актуальные комментарии";
$massiv [12] = "Центральная профсоюзная еженедельная газета Солидарность";
$massiv [13] = "Интернет-портал газеты Красноярский рабочий";
$massiv [14] = "Сибирское агентство новостей";
$massiv [15] = "ФедералПресс Российское информационное агентство (СЗФО)";
$massiv [16] = "Издательский дом Коммерсант";


foreach($massiv as $key => $value)
{ 
   echo "[$key] ", $value, "<br>";
} 

?>